In [1]:
import numpy as np
import pandas as pd

In [2]:
#merging 2 dataframe

In [3]:
employees = pd.DataFrame({
    'employee_ID':[1,2,3,4,5],
    'name' :['Aryan','Kamboj','Virat','Kohli','Rohit'],
    'department' : ['HR','IT','Finance','IT','HR']
})

salaries = pd.DataFrame({
    'employee_ID':[1,2,3,6,7],
    'salart': [60000,50000,45000,70000,20000],
    'bonus':[1000,3000,500,1000,300]
    
})

In [4]:
employees

   employee_ID    name department
0            1   Aryan         HR
1            2  Kamboj         IT
2            3   Virat    Finance
3            4   Kohli         IT
4            5   Rohit         HR

In [5]:
salaries

   employee_ID  salart  bonus
0            1   60000   1000
1            2   50000   3000
2            3   45000    500
3            6   70000   1000
4            7   20000    300

In [8]:
pd.merge(employees,salaries,on='employee_ID',how='inner')  #on means common column and how means only non null rows

   employee_ID    name department  salart  bonus
0            1   Aryan         HR   60000   1000
1            2  Kamboj         IT   50000   3000
2            3   Virat    Finance   45000    500

In [18]:
pd.merge(employees,salaries,on='employee_ID',how='outer')    #outer give all null and non noll rows

   employee_ID    name department   salart   bonus
0            1   Aryan         HR  60000.0  1000.0
1            2  Kamboj         IT  50000.0  3000.0
2            3   Virat    Finance  45000.0   500.0
3            4   Kohli         IT      NaN     NaN
4            5   Rohit         HR      NaN     NaN
5            6     NaN        NaN  70000.0  1000.0
6            7     NaN        NaN  20000.0   300.0

In [19]:
pd.merge(employees,salaries,on='employee_ID',how='left')  #on the basis of left means element put in merge like in this employees

   employee_ID    name department   salart   bonus
0            1   Aryan         HR  60000.0  1000.0
1            2  Kamboj         IT  50000.0  3000.0
2            3   Virat    Finance  45000.0   500.0
3            4   Kohli         IT      NaN     NaN
4            5   Rohit         HR      NaN     NaN

In [9]:
pd.merge(employees,salaries,on='employee_ID',how='right')   #on the basis of right means element put in merge like in this salaries

   employee_ID    name department  salart  bonus
0            1   Aryan         HR   60000   1000
1            2  Kamboj         IT   50000   3000
2            3   Virat    Finance   45000    500
3            6     NaN        NaN   70000   1000
4            7     NaN        NaN   20000    300

**Concationation of 2 dataframes**

In [11]:
df1 = pd.DataFrame({
    'A': ['A0','A1','A2'],
    'B': ['B1','B2','B3'],
    'C': ['C1','C2','C3']
})
df2 = pd.DataFrame({
    'A': ['A3','A4','A5'],
    'B': ['B3','B4','B5'],
    'C': ['C3','C4','C5']
})

In [12]:
df1

    A   B   C
0  A0  B1  C1
1  A1  B2  C2
2  A2  B3  C3

In [13]:
df2

    A   B   C
0  A3  B3  C3
1  A4  B4  C4
2  A5  B5  C5

In [14]:
pd.concat([df1,df2])

    A   B   C
0  A0  B1  C1
1  A1  B2  C2
2  A2  B3  C3
0  A3  B3  C3
1  A4  B4  C4
2  A5  B5  C5

In [15]:
pd.concat([df1,df2],axis = 1)

    A   B   C   A   B   C
0  A0  B1  C1  A3  B3  C3
1  A1  B2  C2  A4  B4  C4
2  A2  B3  C3  A5  B5  C5

In [16]:
pd.concat([df1,df2],axis = 0)

    A   B   C
0  A0  B1  C1
1  A1  B2  C2
2  A2  B3  C3
0  A3  B3  C3
1  A4  B4  C4
2  A5  B5  C5

**Joining 2 data frames**

In [50]:
df3 = pd.DataFrame({
    'name' : ['aryan','kamboj','yuvi','ankush']
},index = [2,3,9,7])      #index se app apni merji se kuch bi rak sakte hai verna se 0 se start hogi

df4 = pd.DataFrame({
    'score' :[79,49,90,55]},
index=[2,3,4,5])

In [51]:
df3

     name
2   aryan
3  kamboj
9    yuvi
7  ankush

In [52]:
df4

   score
2     79
3     49
4     90
5     55

In [53]:
df3.join(df4)

     name  score
2   aryan   79.0
3  kamboj   49.0
9    yuvi    NaN
7  ankush    NaN

In [54]:
df4.join(df3)

   score    name
2     79   aryan
3     49  kamboj
4     90     NaN
5     55     NaN

In [56]:
df4.join(df3,how='outer')

   score    name
2   79.0   aryan
3   49.0  kamboj
4   90.0     NaN
5   55.0     NaN
7    NaN  ankush
9    NaN    yuvi

In [58]:
df4.join(df3,how='inner')

   score    name
2     79   aryan
3     49  kamboj